In [ ]:
# Today's date -- 4/7/2025

In [ ]:
# Object means a string.

In [ ]:
# What is Pandas? --> Pandas is a fast, powerful, flexible and easy-to-use open source data analysis and manipulation tool built on top of the Python programming language.
# It is also one of the most popular libraries used by data experts from all around the world.
# Pandas is used for data wrangling, data analysis and data visualisation.

In [3]:
# Reading csv files(Excel file) & creating your own dataframe.
# to use pandas, we have to first import the pandas library and the way you do that is as follows.

# Import pandas and label it as 'pd' (as alias).

In [4]:
import pandas as pd

In [9]:
# Read data via 'pd.read_csv'
# Use the appropriate read function for different file formats, for example.

train = pd.read_csv("titanic_train.csv") # here train is a variable.
train
# DataFrame

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [10]:
train.head() # 'head' shows the first five rows and all columns of the dataframe by default

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [11]:
# 'tail' shows the bottom five rows and all columns of the dataframes.
train.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [13]:
# 'shape' function tells us how many rows and columns exist in this dataframe.
train.shape

(891, 12)

In [14]:
train.info()  #Logical structure of data

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [15]:
train.isnull().sum() # train.isna().sum()--count of empty cells

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [ ]:
# Five topics are important at file reading time -- (1.read, 2.head(), 3.tail(), 4.info(), 5.null values)

In [16]:
# Creating your own dataframe.
# Number entries

test_scores = pd.DataFrame({'Student_ID': [154,973,645], 
                            'Science': [50,75,31], 'Geography': [88,100,66],
                           'Math': [72,86,94]})
test_scores

   Student_ID  Science  Geography  Math
0         154       50         88    72
1         973       75        100    86
2         645       31         66    94

In [17]:
# Text entries
survey = pd.DataFrame({'James': ['I liked it','more salt'],
                      'Emily': ['It is too sweet','Yum!']})
survey

        James            Emily
0  I liked it  It is too sweet
1   more salt             Yum!

In [ ]:
# Access of Student's data from his roll_no.

In [18]:
# Index -- We can either set an existing column as our index or specify an index when creating a dataframe.
# Let's begin by setting an existing column as index.

test_scores = test_scores.set_index('Student_ID')
test_scores

            Science  Geography  Math
Student_ID
154              50         88    72
973              75        100    86
645              31         66    94

In [20]:
survey = pd.DataFrame({'James':['I liked it', 'more salt'], 'Emily': ['It is too sweet','Yum!']},
                     index = ['Product A', 'Product B'])
survey

                James            Emily
Product A  I liked it  It is too sweet
Product B   more salt             Yum!

In [24]:
# You can also reset the index back to its default.
# Reset Index
# Try playing around with 'drop' and 'inplace' and see what they do.

survey.reset_index(drop=True,inplace=True)

# inplace=True -- means to save the changes.

        James            Emily
0  I liked it  It is too sweet
1   more salt             Yum!

In [25]:
survey

        James            Emily
0  I liked it  It is too sweet
1   more salt             Yum!

In [26]:
# Renaming we want to change the names of the first two columns.
test_scores.rename(columns = {'Geography': 'Physics', 'Science': 'Arts'}, inplace = True)
test_scores

            Arts  Physics  Math
Student_ID
154           50       88    72
973           75      100    86
645           31       66    94

In [27]:
# Drop the 'Math' column
test_scores.drop(columns='Math',inplace=True)
test_scores

            Arts  Physics
Student_ID
154           50       88
973           75      100
645           31       66

In [28]:
# Drop row with student_ID 973
# We can make this more robust once we learn the 'loc' function in the coming weeks
test_scores.drop(973,inplace=True)
test_scores

            Arts  Physics
Student_ID
154           50       88
645           31       66

In [29]:
# Adding columns and rows
test_scores

            Arts  Physics
Student_ID
154           50       88
645           31       66

In [30]:
# create a new column for history subject
test_scores['History']=[79,70]
test_scores

            Arts  Physics  History
Student_ID
154           50       88       79
645           31       66       70